/*----------------------------------【程序说明】-------------------------------------
程序名称:：blur
开发所用IDE版本：Visual Studio 2013
开发所用OpenCV版本：  3.0
2018.7.18  Create by   VV
-----------------------------------------------------------------------------------*/



/*----------------------------------【头文件】---------------------------------------
描述：程序包含的头文件
-----------------------------------------------------------------------------------*/
#include "stdafx.h"
#include <opencv2/opencv.hpp>


/*----------------------------------【命名空间】-------------------------------------
描述：程序使用的命名空间
-----------------------------------------------------------------------------------*/
using namespace cv;
using namespace std;


/*----------------------------------【全局变量】-------------------------------------
描述：全局变量
-----------------------------------------------------------------------------------*/
Mat srcimage, dstimage;//输入输出图片


/*----------------------------------【全局函数】-------------------------------------
描述：全局函数声明
-----------------------------------------------------------------------------------*/


/*----------------------------------【main函数】-------------------------------------
描述：程序主函数
-----------------------------------------------------------------------------------*/
int main()
{
	//输入图片
	srcimage = imread("dog.png");
	if (srcimage.data == NULL){ cout << "图片读取错误!/r/n" << endl; return false; }
	//显示原图片
	imshow("原图", srcimage);
	
	//创建窗口
	namedWindow("滤波", 1);

	//方框滤波
	boxFilter(srcimage,dstimage,-1,Size(3,3));
	imshow("方框滤波", dstimage);

	//均值滤波
	blur(srcimage, dstimage, Size(3, 3));
	imshow("均值滤波", dstimage);

	//高斯滤波
	GaussianBlur(srcimage, dstimage, Size(3, 3),0,0);
	imshow("高斯滤波", dstimage);

	//中值滤波
	medianBlur(srcimage, dstimage, 3);
	imshow("中值滤波", dstimage);

	//双边滤波
	bilateralFilter(srcimage, dstimage,5,5,5);
	imshow("双边滤波", dstimage);

	while (1)
	{
		char c = waitKey(0);
		//按q可退出程序
		if (c == 'q')
			return true;
	}
	return true;
}

