/*----------------------------------【程序说明】-------------------------------------
程序名称:：Scharr
开发所用IDE版本：Visual Studio 2013
开发所用OpenCV版本：  3.0
2018.7.10  Create by   VV
-----------------------------------------------------------------------------------*/



/*----------------------------------【头文件】---------------------------------------
描述：程序包含的头文件
-----------------------------------------------------------------------------------*/
#include "stdafx.h"
#include <opencv2/opencv.hpp>


/*----------------------------------【命名空间】-------------------------------------
描述：程序使用的命名空间
-----------------------------------------------------------------------------------*/
using namespace cv;
using namespace std;


/*----------------------------------【全局变量】-------------------------------------
描述：全局变量
-----------------------------------------------------------------------------------*/
Mat srcimage, dstimage,grad_x,abs_grad_x,grad_y,abs_grad_y;//输入输出图片



/*----------------------------------【全局函数】-------------------------------------
描述：全局函数声明
-----------------------------------------------------------------------------------*/



/*----------------------------------【main函数】-------------------------------------
描述：程序主函数
-----------------------------------------------------------------------------------*/
int main()
{
	
	//输入图片
	srcimage = imread("dog.png");
	if (srcimage.data == NULL){ cout << "图片读取错误!/r/n" << endl; return false; }
	//显示原图片
	imshow("原图", srcimage);
	//创建窗口
	namedWindow("Scharr", 1);
	//求X方向Scharr
	Scharr(srcimage, grad_x,CV_16S,1,0);
	//取绝对值
	convertScaleAbs(grad_x,abs_grad_x);
	//求Y方向Scharr	
	Scharr(srcimage, grad_y, CV_16S, 0, 1);
	//取绝对值
	convertScaleAbs(grad_y, abs_grad_y);
	//合并梯度
	addWeighted(abs_grad_x, 0.5, abs_grad_y,0.5,0,dstimage);
	//显示效果图
	imshow("x方向Scharr",abs_grad_x);
	imshow("y方向Scharr", abs_grad_y);
	imshow("dstimage", dstimage);

	while (1)
	{
		char c = waitKey(0);
		//按q可退出程序
		if (c == 'q')
			return true;
	}
	return true;
}


